The template file path to be used for creating the new document.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2010
 Syntax
  C#
public string Template { get; }
  Visual Basic
Public ReadOnly Property Template As String
	Get
  Visual C++
public:
property String^ Template {
	String^ get ();
}
 See Also
  DocumentCreatingEventArgs Class
  Autodesk.Revit.DB.Events Namespace